; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v13)
             (pred_11 ?v7 ?v8)
             (pred_12 ?v4 ?v8)
             (pred_3 ?v10 ?v4 )
	     (pred_2 ?v4)
             (pred_7 ?v11)
             (pred_1 ?v7)
             (pred_5 ?v8)
             (pred_6 ?v4)
             (pred_4 ?v7)
             (pred_9 ?v4)
             (pred_8 ))



(:action op_3
:parameters (?v2 ?v5 ?v9 ?v6)
:precondition (and (pred_7 ?v2) (pred_7 ?v5) (pred_1 ?v9) (pred_5 ?v6)
          (pred_10 ?v2 ?v5) (pred_11 ?v9 ?v6)
                   (pred_12 ?v5 ?v6) (pred_2 ?v2) 
                   (pred_6 ?v5) (pred_4 ?v9))
:effect (and  (pred_9 ?v5) (not (pred_6 ?v5))))


(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_7 ?v2) (pred_7 ?v3)
               (pred_2 ?v2) (pred_10 ?v2 ?v3) (pred_9 ?v3))
:effect (and (pred_2 ?v3) (not (pred_2 ?v2))))

(:action op_1
:parameters (?v2 ?v9)
:precondition (and (pred_7 ?v2) (pred_1 ?v9) 
                  (pred_2 ?v2) (pred_3 ?v9 ?v2) (pred_8 ))
:effect (and (pred_4 ?v9)
   (not (pred_3 ?v9 ?v2)) (not (pred_8 ))))


(:action op_4
:parameters (?v2 ?v1 ?v12)
:precondition (and (pred_7 ?v2) (pred_1 ?v1) (pred_1 ?v12)
                  (pred_2 ?v2) (pred_4 ?v12) (pred_3 ?v1 ?v2))
:effect (and (pred_4 ?v1) (pred_3 ?v12 ?v2)
        (not (pred_4 ?v12)) (not (pred_3 ?v1 ?v2))))

(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_7 ?v2) (pred_1 ?v9) 
                  (pred_2 ?v2) (pred_4 ?v9))
:effect (and (pred_8 ) (pred_3 ?v9 ?v2) (not (pred_4 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_17 obj_01 obj_11 obj_06 obj_07 obj_20 obj_13 obj_10 obj_08 obj_19 obj_12 obj_16 obj_09 obj_18 obj_05
    obj_04 obj_03
    obj_15 obj_02
    )

    (:init
       (pred_8)

       (pred_7 obj_14)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_13)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_12)
       (pred_7 obj_16)
       (pred_7 obj_09)
       (pred_7 obj_18)
       (pred_7 obj_05)
       (pred_5 obj_04)
       (pred_5 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_02)

       (pred_10 obj_14 obj_06)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_11)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_18 obj_05)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_13)
       (pred_12  obj_05 obj_04)
       (pred_12  obj_13 obj_03)
       (pred_9 obj_14)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_11)
       (pred_9 obj_06)
       (pred_9 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_19)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_18)

       (pred_11  obj_15 obj_04)
       (pred_11  obj_02 obj_03)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_02 obj_20)
       (pred_2 obj_06)
    )

    (:goal (and
       (pred_3 obj_02 obj_12)
    ))
(:constraints
  (always (not (pred_2 obj_07)))
)
)

; plan
1. (op_2 obj_06 obj_14)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_14)
   goals met: 0 of 1
2. (op_2 obj_14 obj_17)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_17)
   goals met: 0 of 1
3. (op_2 obj_17 obj_01)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_01)
   goals met: 0 of 1
4. (op_2 obj_01 obj_20)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_20)
   goals met: 0 of 1
5. (op_1 obj_20 obj_02)
   deleted: (pred_3 obj_02 obj_20) (pred_8)
   added: (pred_4 obj_02)
   goals met: 0 of 1
6. (op_2 obj_20 obj_19)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_12)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_12)
   goals met: 0 of 1
8. (op_4 obj_12 obj_15 obj_02)
   deleted: (pred_4 obj_02) (pred_3 obj_15 obj_12)
   added: (pred_4 obj_15) (pred_3 obj_02 obj_12)
   goals met: 1 of 1
